#Листы
#my_list1 = [1,2,3,4,5,6,7,8,9,10]
#my_list2 = [11,12,13]
#my_list1.extend(my_list2)
#print(my_list1)
#my_list1.append(3)
#print(my_list1)


#For
#for i in range(1,21):
#    print(i)


#for i in range(1,21):
#   if i % 2 == 0:
#        print(i)


# Список с Квадратичными степеннями 
#numbers = [1,2,3,4,5,6,7,8,9,10]
#squares = []
#for num in numbers:
#    squares.append(num**2)
#print(squares)

# Вывести только те числа из списка, которые делятся на 3.
#my_list = [1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20]
#
#for num in my_list:
#    if num % 3 == 0:
#        print(num)


#total_sum = 0  # Инициализируем переменную для хранения суммы
#
#for num in range(1, 101):  # Перебираем числа от 1 до 100
#    if num % 5 == 0 or num % 7 == 0:  # Проверяем, делится ли число на 5 или 7
#        total_sum += num  # Добавляем число к общей сумме
#
#print(total_sum)  # Выводим итоговую сумму


#my_list = [10, 20, 35, 50, 15, 40, 70, 60]  # Пример списка чисел
#max_num = my_list[0]  # Начинаем с первого числа как текущего максимума
#
#for num in my_list:
#    if num > max_num:  # Если текущее число больше текущего максимума
#        max_num = num  # Обновляем максимальное число
#
#print(max_num)  # Выводим максимальное число


#my_string = "Hello, world!"
#
#for ch in my_string:  # Перебираем каждый символ строки
#    print(ch)  # Печатаем каждый символ на новой строке


#number = 3  # Число, для которого выводим таблицу умножения
#
#for i in range(1, 11):  # Перебираем числа от 1 до 10
#   print(f"{number} * {i} = {number * i}")  # Выводим строку таблицы умножения


#number = 5
#for i in range(1,21):
#    print(f"{number} * {i} = {number * i}")


#number = 7
#for i in range(1,15):
#    print(f"{number} * {i} = {number * i}")


#number = 10
#for i in range(1,8):
#    print(f"{number} * {i} = {number * i}")


#number = 15
#for i in range(1,25):
#    print(f"{number} * {i} = {number* i}")


#number = 70
#for i in range(1,91):
#    print(f"{number} * {i} = {number * i}")


#number = 50
#for i in range(1,5):
#    print(f"{number} / {i} = {number / i}")


# Перебираем числа от 1 до 10 и выводим их квадраты
#for i in range(1, 11):  # От 1 до 10 включительно
#    print(f"{i}^2 = {i ** 2}")


